CARAVAN/app/controllers/blogs_controller.rb

  def show
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    # 記事を全件取得
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
    blog = Blog.new(blog_params)
    blog.save
---
INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト"], ["category", "Mathematics"], ["body", "テスト本文"], ["created_at", "2018-02-07 11:41:42.647377"], ["updated_at", "2018-02-07 11:41:42.647377"]]

  def edit
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "修正"], ["updated_at", "2018-02-08 09:28:24.220982"], ["id", 1]]

  def destroy
    blog = Blog.find(params[:id])
    blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]